; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v7 - type_3 ?v2 - type_1)
 	      (pred_4 ?v6 - object ?v2 - type_1)
	      (pred_1 ?v7 - type_3 ?v3 - type_2)
	      (pred_2 ?v7 - type_3 ?v6 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v7 - type_3 ?v1 ?v4 - type_1)
       :precondition (and  (pred_3 ?v7 ?v1))
       :effect (and  (pred_3 ?v7 ?v4)
		     (not (pred_3 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_3 ?v5 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v8) (pred_3 ?v7 ?v8) (pred_1 ?v7 ?v3))
       :effect (and (pred_2 ?v7 ?v5 ?v3)
		    (not (pred_4 ?v5 ?v8)) 
		    (not (pred_1 ?v7 ?v3))))

   (:action op_1
       :parameters (?v7 - type_3 ?v5 - object ?v8 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v7 ?v5 ?v3) (pred_3 ?v7 ?v8))
       :effect (and (pred_4 ?v5 ?v8)
		    (pred_1 ?v7 ?v3)
		    (not (pred_2 ?v7 ?v5 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_11 - type_3
obj_03 obj_04 obj_06 obj_05 - type_2
obj_01 obj_08 obj_09 obj_10 - type_1
obj_12 obj_07 obj_02 - object)
(:init
(pred_3 obj_13 obj_08)
(pred_1 obj_13 obj_03)
(pred_1 obj_13 obj_04)
(pred_3 obj_11 obj_09)
(pred_1 obj_11 obj_06)
(pred_1 obj_11 obj_05)
(pred_4 obj_12 obj_10)
(pred_4 obj_07 obj_10)
(pred_4 obj_02 obj_10)
)
(:goal
(and
(pred_4 obj_12 obj_08)
(pred_4 obj_07 obj_08)
(pred_4 obj_02 obj_09)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_13 obj_10) (pred_3 obj_11 obj_10))))
  )
)
)

; plan
1. (op_2 obj_13 obj_08 obj_09)
   deleted: (pred_3 obj_13 obj_08)
   added: (pred_3 obj_13 obj_09)
   goals met: 0 of 3
2. (op_2 obj_11 obj_09 obj_10)
   deleted: (pred_3 obj_11 obj_09)
   added: (pred_3 obj_11 obj_10)
   goals met: 0 of 3
3. (op_3 obj_11 obj_02 obj_10 obj_05)
   deleted: (pred_4 obj_02 obj_10) (pred_1 obj_11 obj_05)
   added: (pred_2 obj_11 obj_02 obj_05)
   goals met: 0 of 3
4. (op_3 obj_11 obj_07 obj_10 obj_06)
   deleted: (pred_4 obj_07 obj_10) (pred_1 obj_11 obj_06)
   added: (pred_2 obj_11 obj_07 obj_06)
   goals met: 0 of 3
5. (op_2 obj_13 obj_09 obj_08)
   deleted: (pred_3 obj_13 obj_09)
   added: (pred_3 obj_13 obj_08)
   goals met: 0 of 3
6. (op_2 obj_11 obj_10 obj_08)
   deleted: (pred_3 obj_11 obj_10)
   added: (pred_3 obj_11 obj_08)
   goals met: 0 of 3
7. (op_2 obj_13 obj_08 obj_10)
   deleted: (pred_3 obj_13 obj_08)
   added: (pred_3 obj_13 obj_10)
   goals met: 0 of 3
8. (op_1 obj_11 obj_07 obj_08 obj_06)
   deleted: (pred_2 obj_11 obj_07 obj_06)
   added: (pred_4 obj_07 obj_08) (pred_1 obj_11 obj_06)
   goals met: 1 of 3
9. (op_3 obj_13 obj_12 obj_10 obj_04)
   deleted: (pred_4 obj_12 obj_10) (pred_1 obj_13 obj_04)
   added: (pred_2 obj_13 obj_12 obj_04)
   goals met: 1 of 3
10. (op_2 obj_11 obj_08 obj_09)
   deleted: (pred_3 obj_11 obj_08)
   added: (pred_3 obj_11 obj_09)
   goals met: 1 of 3
11. (op_2 obj_13 obj_10 obj_08)
   deleted: (pred_3 obj_13 obj_10)
   added: (pred_3 obj_13 obj_08)
   goals met: 1 of 3
12. (op_1 obj_11 obj_02 obj_09 obj_05)
   deleted: (pred_2 obj_11 obj_02 obj_05)
   added: (pred_4 obj_02 obj_09) (pred_1 obj_11 obj_05)
   goals met: 2 of 3
13. (op_1 obj_13 obj_12 obj_08 obj_04)
   deleted: (pred_2 obj_13 obj_12 obj_04)
   added: (pred_4 obj_12 obj_08) (pred_1 obj_13 obj_04)
   goals met: 3 of 3
